Sentaku1129/STM32/SysTick_LED/USER/main.c
#include "stm32f10x.h"
#include "SysTick.h"

#define R_LED GPIO_Pin_5
#define G_LED GPIO_Pin_0
#define B_LED GPIO_Pin_1

#define KEY1  GPIO_Pin_0 
#define KEY2  GPIO_Pin_13

void LED_GPIO_Config()
{
		/*定义一个GPIO_InitTypeDef类型的结构体*/
		GPIO_InitTypeDef GPIO_InitStructure;

		/*开启LED相关的GPIO外设时钟*/
		//RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
		/*选择要控制的GPIO引脚*/
		GPIO_InitStructure.GPIO_Pin = R_LED|B_LED|G_LED;
		/*设置引脚模式为通用推挽输出*/
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
		/*设置引脚速率为50MHz */   
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; 
		/*调用库函数，初始化GPIOB*/
		GPIO_Init(GPIOB, &GPIO_InitStructure);
		/* 关闭所有led灯	*/
		GPIO_SetBits(GPIOB, GPIO_Pin_0);
		/* 关闭所有led灯	*/
		GPIO_SetBits(GPIOB, GPIO_Pin_1);	 
    /* 关闭所有led灯	*/
		GPIO_SetBits(GPIOB, GPIO_Pin_5);
}

int main()
{
	LED_GPIO_Config();            	//GPIOD初始化配置
		
	while(1)
	{
		GPIO_ResetBits(GPIOB,R_LED);
		Delay_Ms(2000);							//中断2秒定时
		GPIO_SetBits(GPIOB,R_LED);
		SysTick_Delay_Ms(3000);			//轮询COUNTFLAG标志位3秒定时
		
		GPIO_ResetBits(GPIOB,G_LED);
		Delay_Ms(2000);							//中断2秒定时
		GPIO_SetBits(GPIOB,G_LED);
		SysTick_Delay_Ms(3000);			//轮询COUNTFLAG标志位3秒定时
		
		GPIO_ResetBits(GPIOB,B_LED);
		Delay_Ms(2000);							//中断2秒定时
		GPIO_SetBits(GPIOB,B_LED);
		SysTick_Delay_Ms(3000);			//轮询COUNTFLAG标志位3秒定时
	}
}
